<?php

// Инициализация переменной для вывода чисел от 1 до 5
$number = 1;

// Цикл для вывода чисел от 1 до 5 с использованием инкрементирования
echo "Числа от 1 до 5:\n";
while ($number <= 5) {
 echo $number . " ";
 $number++; // Инкрементирование переменной $number
}
echo "\n";

// Инициализация переменной для вывода степеней двойки от 2 до 32
$power_of_two = 2;

// Цикл для вывода степеней двойки от 2 до 32 с использованием умножения присваиванием
echo "Степени двойки от 2 до 32:\n";
while ($power_of_two <= 32) {
 echo $power_of_two . " ";
 $power_of_two *= 2; // Умножение переменной $power_of_two на 2 
}
echo "\n";


echo "neww info";
